app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("name_en", "name_ru", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name_en", "en"], ["name_ru", "rus"], ["created_at", "2017-04-04 10:53:39.883244"], ["updated_at", "2017-04-04 10:53:39.883244"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save