app/controllers/admin/products_controller.rb

INSERT INTO "products" ("title_en", "title_ru", "description_en", "description_ru", "price", "category_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "title_en" = ?, "title_ru" = ?, "description_en" = ?, "description_ru" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title_en", "en"], ["title_ru", "rus"], ["description_en", "d en"], ["description_ru", "d rus"], ["updated_at", "2017-04-04 05:44:01.935983"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
---
  def destroy
    @product = Product.destroy(params[:id])