app/views/admin/products/_form.html.erb

      <div class="col-sm-10">
        <%= f.collection_select :category_id, Category.all, :id, ("name_" + "#{I18n.locale}").to_sym, {}, class: 'form-control' %>
---
SELECT "categories".* FROM "categories"