app/controllers/products_controller.rb

  def index
    @products = Product.paginate(page: params[:page], per_page: 10)
---
SELECT  "products".* FROM "products" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "products"

  def show_product
  	@product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def show_category
  	@products = Product.where(category_id: params[:id]).paginate(page: params[:page], per_page: 10)
---
SELECT  "products".* FROM "products" WHERE "products"."category_id" = ? LIMIT 10 OFFSET 0  [["category_id", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]

  def update_avatar
  	if user_signed_in?
  		@user = User.find(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

  def save_avatar
  	@user = User.find(current_user)
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "doski-chernyy-ryad-tekstura-fon.jpg"], ["updated_at", "2017-04-04 12:56:06.579102"], ["id", 2]]